Revit 2027 API
Part.ResetFaceOffset Method
 Resets the offset applied to the given part face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ResetFaceOffset(
	Face face
)
Public Sub ResetFaceOffset (
	face As Face
)
public:
void ResetFaceOffset(
	Face^ face
)
member ResetFaceOffset :
        face : Face -> unit
Parameters
face Face
 The face whose offset needs to be reset.
Exceptions
Exception | Condition
ArgumentException |  face does not belong to the part.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Part Class
Autodesk.Revit.DB Namespace